set_property IOSTANDARD LVCMOS33 [get_ports clk]
set_property PACKAGE_PIN R2 [get_ports clk]
create_clock -period 10.000 -name sys_clk_pin -waveform {0.000 5.000} -add [get_ports clk]
set_property IOSTANDARD LVCMOS33 [get_ports rst]
set_property PACKAGE_PIN C18 [get_ports rst]
set_property PULLUP true [get_ports rst]

set_property IOSTANDARD LVCMOS33 [get_ports {data[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {data[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {data[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {data[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {data[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {data[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {data[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {data[0]}]

set_property PACKAGE_PIN A16 [get_ports {data[7]}]
set_property PACKAGE_PIN D16 [get_ports {data[6]}]
set_property PACKAGE_PIN C13 [get_ports {data[5]}]
set_property PACKAGE_PIN D17 [get_ports {data[4]}]
set_property PACKAGE_PIN C14 [get_ports {data[3]}]
set_property PACKAGE_PIN D14 [get_ports {data[2]}]
set_property PACKAGE_PIN D18 [get_ports {data[1]}]
set_property PACKAGE_PIN D15 [get_ports {data[0]}]

set_property IOSTANDARD LVCMOS33 [get_ports txe_n]
set_property PACKAGE_PIN B16 [get_ports txe_n]

set_property IOSTANDARD LVCMOS33 [get_ports rxf_n]
set_property PACKAGE_PIN A14 [get_ports rxf_n]

set_property IOSTANDARD LVCMOS33 [get_ports wr_n]
set_property PACKAGE_PIN G13 [get_ports wr_n]

set_property IOSTANDARD LVCMOS33 [get_ports rd_n]
set_property PACKAGE_PIN B14 [get_ports rd_n]

set_property IOSTANDARD LVCMOS33 [get_ports oe_n]
set_property PACKAGE_PIN R17 [get_ports oe_n]

set_property IOSTANDARD LVCMOS33 [get_ports siwu]
set_property PACKAGE_PIN R16 [get_ports siwu]

set_property IOSTANDARD LVCMOS33 [get_ports clkout]
set_property PACKAGE_PIN V13 [get_ports clkout]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets clkout_IBUF]


create_clock -period 33.333 -name clkout -waveform {0.000 16.667} [get_ports clkout]
create_generated_clock -name {xobuslite_phy/incoming_fifo/graycounter0_q_reg_n_0_[0]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/graycounter0_q_reg[0]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/graycounter0_q_reg_n_0_[1]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/graycounter0_q_reg[1]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/graycounter0_q_reg_n_0_[2]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/graycounter0_q_reg[2]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/graycounter0_q_reg_n_0_[3]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/graycounter0_q_reg[3]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/graycounter0_q_reg_n_0_[4]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/graycounter0_q_reg[4]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/graycounter0_q_reg_n_0_[5]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/graycounter0_q_reg[5]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg_n_0_[0]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg[0]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg_n_0_[1]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg[1]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg_n_0_[2]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg[2]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg_n_0_[3]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg[3]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg_n_0_[4]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg[4]/Q}]
create_generated_clock -name {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg_n_0_[5]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/incoming_fifo/multiregimpl1_regs1_reg[5]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/graycounter1_q[0]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/graycounter1_q_reg[0]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/graycounter1_q[1]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/graycounter1_q_reg[1]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/graycounter1_q[2]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/graycounter1_q_reg[2]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/graycounter1_q[3]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/graycounter1_q_reg[3]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/graycounter1_q[4]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/graycounter1_q_reg[4]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/graycounter1_q[5]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/graycounter1_q_reg[5]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1[0]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1_reg[0]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1[1]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1_reg[1]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1[2]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1_reg[2]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1[3]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1_reg[3]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1[4]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1_reg[4]/Q}]
create_generated_clock -name {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1[5]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/outgoing_fifo/multiregimpl0_regs1_reg[5]/Q}]
create_generated_clock -name {xobuslite_phy/state[0]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/FSM_sequential_state_reg[0]/Q}]
create_generated_clock -name {xobuslite_phy/state[1]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/FSM_sequential_state_reg[1]/Q}]
create_generated_clock -name {xobuslite_phy/state[2]} -source [get_ports clkout] -divide_by 1 [get_pins {xobuslite_phy/FSM_sequential_state_reg[2]/Q}]
set_input_delay -clock [get_clocks clkout] -clock_fall -min -add_delay 66.660 [get_ports {data[*]}]
set_input_delay -clock [get_clocks clkout] -clock_fall -max -add_delay 66.660 [get_ports {data[*]}]
set_input_delay -clock [get_clocks clkout] -min -add_delay 66.660 [get_ports {data[*]}]
set_input_delay -clock [get_clocks clkout] -max -add_delay 66.660 [get_ports {data[*]}]
create_debug_core u_ila_0 ila
set_property ALL_PROBE_SAME_MU true [get_debug_cores u_ila_0]
set_property ALL_PROBE_SAME_MU_CNT 4 [get_debug_cores u_ila_0]
set_property C_ADV_TRIGGER true [get_debug_cores u_ila_0]
set_property C_DATA_DEPTH 8192 [get_debug_cores u_ila_0]
set_property C_EN_STRG_QUAL true [get_debug_cores u_ila_0]
set_property C_INPUT_PIPE_STAGES 0 [get_debug_cores u_ila_0]
set_property C_TRIGIN_EN false [get_debug_cores u_ila_0]
set_property C_TRIGOUT_EN false [get_debug_cores u_ila_0]
set_property port_width 1 [get_debug_ports u_ila_0/clk]
connect_debug_port u_ila_0/clk [get_nets [list clkout_IBUF_BUFG]]
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe0]
set_property port_width 8 [get_debug_ports u_ila_0/probe0]
connect_debug_port u_ila_0/probe0 [get_nets [list {data_OBUF[0]} {data_OBUF[1]} {data_OBUF[2]} {data_OBUF[3]} {data_OBUF[4]} {data_OBUF[5]} {data_OBUF[6]} {data_OBUF[7]}]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe1]
set_property port_width 8 [get_debug_ports u_ila_0/probe1]
connect_debug_port u_ila_0/probe1 [get_nets [list {data_IBUF[0]} {data_IBUF[1]} {data_IBUF[2]} {data_IBUF[3]} {data_IBUF[4]} {data_IBUF[5]} {data_IBUF[6]} {data_IBUF[7]}]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe2]
set_property port_width 1 [get_debug_ports u_ila_0/probe2]
connect_debug_port u_ila_0/probe2 [get_nets [list rd_n_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe3]
set_property port_width 1 [get_debug_ports u_ila_0/probe3]
connect_debug_port u_ila_0/probe3 [get_nets [list txe_n_IBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe4]
set_property port_width 1 [get_debug_ports u_ila_0/probe4]
connect_debug_port u_ila_0/probe4 [get_nets [list wr_n_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe5]
set_property port_width 1 [get_debug_ports u_ila_0/probe5]
connect_debug_port u_ila_0/probe5 [get_nets [list rxf_n_IBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe6]
set_property port_width 1 [get_debug_ports u_ila_0/probe6]
connect_debug_port u_ila_0/probe6 [get_nets [list oe_n_OBUF]]
create_debug_port u_ila_0 probe
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_0/probe7]
set_property port_width 1 [get_debug_ports u_ila_0/probe7]
connect_debug_port u_ila_0/probe7 [get_nets [list {data_TRI[0]}]]
create_debug_core u_ila_1 ila
set_property ALL_PROBE_SAME_MU true [get_debug_cores u_ila_1]
set_property ALL_PROBE_SAME_MU_CNT 4 [get_debug_cores u_ila_1]
set_property C_ADV_TRIGGER true [get_debug_cores u_ila_1]
set_property C_DATA_DEPTH 8192 [get_debug_cores u_ila_1]
set_property C_EN_STRG_QUAL true [get_debug_cores u_ila_1]
set_property C_INPUT_PIPE_STAGES 0 [get_debug_cores u_ila_1]
set_property C_TRIGIN_EN false [get_debug_cores u_ila_1]
set_property C_TRIGOUT_EN false [get_debug_cores u_ila_1]
set_property port_width 1 [get_debug_ports u_ila_1/clk]
connect_debug_port u_ila_1/clk [get_nets [list clk_IBUF_BUFG]]
set_property PROBE_TYPE DATA_AND_TRIGGER [get_debug_ports u_ila_1/probe0]
set_property port_width 1 [get_debug_ports u_ila_1/probe0]
connect_debug_port u_ila_1/probe0 [get_nets [list rst_IBUF]]
set_property C_CLK_INPUT_FREQ_HZ 300000000 [get_debug_cores dbg_hub]
set_property C_ENABLE_CLK_DIVIDER false [get_debug_cores dbg_hub]
set_property C_USER_SCAN_CHAIN 1 [get_debug_cores dbg_hub]
connect_debug_port dbg_hub/clk [get_nets clk_IBUF_BUFG]
